; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   grey_ball_2 - ball
   green_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (seen_psi_1) (hold_2) (hold_3))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (= ?obj grey_ball_2) (carrying grey_ball_2)) (seen_psi_1)) (when (and (locked green_door_1) (not (or (= ?obj grey_ball_2) (carrying grey_ball_2)))) (not (hold_3))) (when (or (= ?obj grey_ball_2) (carrying grey_ball_2)) (hold_3)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (carrying grey_ball_2) (not (= ?obj grey_ball_2))) (seen_psi_1)) (when (and (locked green_door_1) (not (and (carrying grey_ball_2) (not (= ?obj grey_ball_2))))) (not (hold_3))) (when (and (carrying grey_ball_2) (not (= ?obj grey_ball_2))) (hold_3)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))) (seen_psi_1)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (hold_0)) (when (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1))))) (hold_2)) (when (and (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1))))) (not (carrying grey_ball_2))) (not (hold_3))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 green_door_2 green_door_3 - door
   yellow_box_1 purple_box_1 green_box_1 green_box_2 - box
   purple_ball_1 red_ball_1 grey_ball_1 - ball
 )
 (:init (agentinroom room_1) (objectinroom green_box_1 room_1) (objectinroom grey_ball_1 room_1) (objectinroom green_box_2 room_1) (objectinroom purple_ball_1 room_3) (objectinroom purple_box_1 room_3) (objectinroom red_ball_1 room_3) (objectinroom grey_ball_2 room_3) (objectinroom yellow_box_1 room_4) (objectcolor green_box_1 greentype) (objectcolor grey_ball_1 greytype) (objectcolor green_box_2 greentype) (objectcolor purple_ball_1 purpletype) (objectcolor purple_box_1 purpletype) (objectcolor red_ball_1 redtype) (objectcolor grey_ball_2 greytype) (objectcolor yellow_box_1 yellowtype) (objectcolor green_door_1 greentype) (objectcolor purple_door_1 purpletype) (objectcolor green_door_2 greentype) (objectcolor green_door_3 greentype) (emptyhands) (locked green_door_1) (locked purple_door_1) (locked green_door_2) (locked green_door_3) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 purple_door_1) (adjacentrooms room_1 room_3 purple_door_1) (adjacentrooms room_4 room_2 green_door_2) (adjacentrooms room_2 room_4 green_door_2) (adjacentrooms room_4 room_3 green_door_3) (adjacentrooms room_3 room_4 green_door_3) (visited room_1) (hold_2) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greentype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_2) (hold_3)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor purple_door_1 room_1 room_3)
   added: (at_ purple_door_1)
   goals met: 1 of 4
2. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 4
3. (gotoroom room_1 room_3 purple_door_1)
   deleted: (agentinroom room_1) (at_ purple_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 4
4. (gotoobject grey_ball_2 room_3)
   added: (at_ grey_ball_2)
   goals met: 1 of 4
5. (pick grey_ball_2 room_3)
   deleted: (at_ grey_ball_2) (emptyhands) (objectinroom grey_ball_2 room_3)
   added: (carrying grey_ball_2) (seen_psi_1) (hold_3)
   goals met: 2 of 4
6. (gotoroom room_3 room_1 purple_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1)
   goals met: 2 of 4
7. (gotodoor green_door_1 room_1 room_2)
   added: (at_ green_door_1)
   goals met: 2 of 4
8. (toggle green_door_1)
   deleted: (locked green_door_1)
   added: (hold_0)
   goals met: 4 of 4
